{
  "articles": [
    {
      "source": {
      "id": 1,
      "categoryId":1,
      "name": "CleanTechnica"
      },
      "author": "Remeredzai Joseph Kuhudzai",
      "title": "Honda Fit & Wuling Bingo April Sales In China Give Us An Indication Of What’s To Come",
      "description": "One of my favourite reports of the month, the China EV Sales Report, was published yesterday. I always look forward to the monthly China EV Sales Reports here on CleanTechnica. That’s because markets like China and India are probably the most likely candidate…",
      "content": "One of my favourite reports of the month, the China EV Sales Report, was published yesterday. I always look forward to the monthly China EV Sales Reports here on CleanTechnica. That’s because markets like China and India are probably the most likely candidates for scaling affordable electric vehicles for the masses in their home markets, and thereafter helping to facilitate a transition to electric mobility in other places around the world as well. I recently authored an article following the launch of the new BYD Seagull in China where the new Seagull was launched at prices that are lower than a comparable popular internal combustion engine hatchback such the Honda Fit. The Seagull was officially launched at 73,800 yuan ($10,690). Just under $11,000 for a compact hatchback with a 30.8 kWh battery is really impressive. The Seagull is based on BYD’s e-platform 3.0 and falls under the Ocean series, which also includes the Dolphin and the Seal. The Seagull has a single electric motor with 75 hp (55 kW) and 135 Nm of torque. It is front-wheel drive. It also has a top speed of 130 km/h, and acceleration from 0–50 km/h takes 4.9 seconds. The two Blade battery options of 30.08 kWh and 38.88 kWh give ranges of 305 km and 405 km (CLTC) respectively. The Seagull has fast charging, which takes 30 minutes to get from 10% to 80% battery. I must say it looks really good at that price. The 2023 Honda Fit 1.5L ICE starts from 89,800 yuan ($12,500). Therefore, the BYD Seagull is already cheaper than this type of common ICE car. There is another cool small hatchback that has also been launched recently in the Chinese market, which is the Wuling Bingo. The Bingo looks like another smash hit from the SAIC, GM, and Wuling joint venture. Here are the specs of the Wuling Bingo: The Bingo’s dimensions are 3950/1708/1580 mm with a wheelbase of 2560 mm. It will have two options, one with a 30 kW (41 hp) motor and another with a 50 kW (68 hp) motor. These options will come in a 17.3 kWh and a 31.9 kWh version with a range of 203 km or 333 km, respectively. The Wuling Bingo is even cheaper than the BYD Seagull. The Wuling Bingo starts from around $8,600. With such attractive pricing, surely both the BYD Seagull and the Wuling Bingo should do well in China and easily beat ICE vehicles in a similar segment on the sales charts. Well, we are starting to see the first signs of that. As reported in the latest China sales report, the Wuling Bingo sold 15,011 units in April, its first full month of sales, beating the Honda Fit in China (6,453 units). This is pretty impressive for a model in its first full month of sales and still in production ramp-up. The BYD Seagull had its first full month of sales in May and I look forward to seeing how well it does in this segment. The Seagull should also find it fairly easy to outdo ICE equivalents like the Honda Fit. The interesting battle could actually be between the two new EV hatchbacks and in a future plethora of other similar electric hatchbacks that are surely to follow in this segment.",
      "image": "/images/image1.jpeg",
      "publishedAt": "2023-06-02T05:44:04Z"
      },
      {
      "source": {
      "id": 2,
      "categoryId":1,
      "name": "Biztoc.com"
      },
      "author": "theguardian.com",
      "title": "Elon Musk accused of insider trading in Dogecoin lawsuit",
      "description": "Elon Musk is being accused of insider trading in a proposed class action lawsuit by investors. They say the Tesla CEO manipulated the cryptocurrency Dogecoin, costing them billions of dollars. In a Wednesday night filing in Manhattan federal court, investors …",
      "image": "/images/image2.jpeg",
      "publishedAt": "2023-06-02T05:40:05Z",
      "content": "Elon Musk is being accused of insider trading in a proposed class action lawsuit by investors. They say the Tesla CEO manipulated the cryptocurrency Dogecoin, costing them billions of dollars. In a Wednesday night filing in Manhattan federal court, investors said Musk used Twitter posts, paid online influencers, his 2021 appearance on NBC’s Saturday Night Live and other “publicity stunts” to trade profitably at their expense through several Dogecoin wallets that he or Tesla controls. Investors said this included when Musk sold about $124m of Dogecoin in April after he replaced Twitter’s blue bird logo with Dogecoin’s shiba inu dog logo, leading to a 30% jump in Dogecoin’s price. A “deliberate course of carnival barking, market manipulation and insider trading” enabled Musk to defraud investors and promote himself and his companies, the filing said. Musk bought Twitter last October. He also runs SpaceX, a rocket and spacecraft manufacturer, as well as the electric carmaker Tesla. Alex Spiro, a lawyer for Musk and Tesla, declined to comment on Thursday. The investors’ lawyer did not immediately respond to requests for comment. Investors have accused Musk, the world’s richest person, of deliberately driving up Dogecoin’s price more than 36,000% over two years and then letting it crash. They included their latest accusations in a proposed third amended complaint, in a lawsuit that began last June. Musk and Tesla had in March sought a dismissal of the second amended complaint, calling it a “fanciful work of fiction”, and on 26 May said another amendment was unjustified."
      },
      {
      "source": {
      "id": 3,
      "categoryId":2,
      "name": "Financetwitter.com"
      },
      "author": "financetwitter",
      "title": "Tesla & JPMorgan Won’t Quit China – Why U.S. Billionaires And Business Leaders Refuse To Decouple From China",
      "description": "Some 5 years ago, President Donald Trump launched a trade war with China. The goal was to decouple the U.S. economy from China. In 2020, with the U.S. presidential election approaching, Trump again raised the idea of separating the American and Chinese econom…",
      "image": "/images/image3.jpeg",
      "publishedAt": "2023-06-02T05:15:59Z",
      "content": "Some 5 years ago, President Donald Trump launched a trade war with China. The goal was to decouple the U.S. economy from China. In 2020, with the U.S. presidential election approaching, Trump again raised the idea of separating the American and Chinese economies. In both 2016 and 2020 campaigns, China became the easy punching bag of American politicians. Trump argued that “decouple”  -a fancy word to permanently end trade between the two nations-  would see Americans saving billions of dollars. He said America will become a manufacturing superpower. He claimed decoupling and tariffs will end America’s reliance on China. Heck, he had even threatened to block companies that outsource jobs to China from receiving federal contracts. None of those happened. The U.S. trade deficit with China was US$310.3 billion in 2020 before Trump left office in January 2021. China still remains the world’s manufacturing superpower. American consumers and businesses paid the tariffs rather than the Chinese. And American companies continue to outsource jobs to China while Trump could only watch. His successor, President Joe Biden, eager to look tough on China, has enhanced the decoupling process by restricting high-tech exports and curtailing professional and financial links. Despite the new tech war, the latest U.S. Census Bureau data showed the U.S. trade deficit with China was larger in 2022, while America’s overall trade deficit hit an all-time high of US$1.18 trillion. Although the value of U.S. imports from China was essentially the same in 2022 as it was in 2017, total U.S. imports increased by about US$900 billion during this period. On paper, it appeared U.S. imports of manufactured goods have increased from Mexico and Vietnam. However, behind the scene, it was China that supplied those goods, before both countries export to the U.S. In reality, China’s exports to Vietnam have more than doubled since 2017, and its trade surplus nearly tripled by 2022. In the same breath, China’s exports to Mexico increased by nearly 30% in 2022, on top of a 50% increase in 2021. The Chinese have been quietly exporting to the U.S. thru Mexico and Vietnam to create a false impression that the U.S. had found alternatives."
      },
      {
      "source": {
      "id": 4,
      "categoryId":2,
      "name": "Barron's"
      },
      "author": "Andrew Welsch",
      "title": "David Giroux Looks into the Future",
      "description": "T. Rowe Price CIO David Giroux discusses the trends and technologies that will transform entire sectors of the economy—and the way we live and invest.",
      "image": "/images/image4.jpeg",
      "publishedAt": "2023-06-02T05:11:59Z",
      "content": "It could take years for fully self-driving cars to become reality. But aspects of the technology are being adopted now, and they will make driving a safer and better experience for everyone, says Dav… [+10327 chars]"
      },
      {
      "source": {
      "id": 5,
      "categoryId":2,
      "name": "HYPEBEAST"
      },
      "author": "info@hypebeast.com (Hypebeast)",
      "title": "Elon Musk Regains Title of World's Richest Man",
      "description": "Multi-hyphenate CEO Elon Musk makes headlines as he is crowned the world's richest man, once again. The Tesla founder regains his title at the top after shares of the electric vehicle company saw shares rise 24% in May. According to the Bloomberg Billionaires…",
      "image": "https://image-cdn.hypb.st/https%3A%2F%2Fhypebeast.com%2Fimage%2F2023%2F06%2Felon-musk-worlds-richest-man-again-dethrones-lvmh-bernard-arnault-tw-e1685672887815.jpg?w=960&cbr=1&q=90&fit=max",
      "publishedAt": "2023-06-02T04:30:29Z",
      "content": "Multi-hyphenate CEO Elon Musk makes headlines as he is crowned the world’s richest man, once again. The Tesla founder regains his title at the top after shares of the electric vehicle company saw shares rise 24% in May. According to the Bloomberg Billionaires Index, Musk’s wealth saw his wealth increase 40.3% this year to $192 billion USD with his 13% ownership of Tesla. Musk knocked out LVMH CEO Bernard Arnault from the top spot. Arnault regained the title when Tesla’s shares saw a steep decline following Musk’s $44 billion USD acquisition of Twitter. Musk’s wealth is mostly tied to Tesla and it is therefore volatile and dependent on how Tesla succeeds. Back in November, Tesla’s stock hit a two-year low where share price dropped to $167.87 USD when Musk took over Twitter. Arnault, who is now in second place with a net worth of $187 billion USD, is followed by Amazon billionaire Jeff Bezos. Musk’s net worth is approximately $192 billion USD at the moment. Arnault’s wealth surpassed Musk’s in December due to success and wealth boom that charged the luxury goods sales. LVMH shares have increased 19.7% this year while Tesla’s have risen 65.6% in the year to date. As the race of the billionaires continue, it remains to be seen who will dethrone Musk next."
     },
      {
      "source": {
      "id": 6,
      "categoryId":2,
      "name": "Yahoo Entertainment"
      },
      "author": "Sofia Horta e Costa",
      "title": "This Week in China: Biggest Reopening Fans Are Now Underweight",
      "description": "(Bloomberg) -- No valuation case seems compelling enough to keep global investors from giving up on Chinese assets.Most Read from BloombergChina Is Drilling ...",
      "image": "/images/image6.jpeg",
      "publishedAt": "2023-06-02T04:26:04Z",
      "content": "(Bloomberg) -- No valuation case seems compelling enough to keep global investors from giving up on Chinese assets.Most Read from Bloomberg China Is Drilling a 10,000-Meter-Deep Hole Into the Earth Inside the Making of Redfall, Xbox’s Latest Misfire Wall Street Banks Are Using AI to Rewire the World of Finance Debt-Limit Deal Clears Congress, Ending Threat of US Default Apple Plans Major Retail Push With New Stores Across China, US The evidence is everywhere. The MSCI China Index is in a bear market and trading at just 9.4 times earnings. That’s about a 40% discount to the MSCI’s world gauge. The yuan has plummeted to levels last seen in November and credit risk is spreading across to local government issuers. Don’t be fooled by Friday’s stock rebound. It was underpinned by low volume. Hedge funds — the fast money who were first in and first out of Chinese stocks — have unwound more than half of the positions added in the November to January period, according to strategists at Goldman Sachs Group Inc. Sentiment is so bearish now that even European-based money managers, the biggest buyers of Chinese shares in the first quarter, have turned underweight on the market after driving much of the $1.6 billion of outflows in May, according to Morgan Stanley’s quantitative research team. US institutional investors, who never really chased the reopening trade, have continued to unload Chinese stocks. They now hold just $714 billion, down from a peak of $1.1 trillion in 2020, according to Goldman. The outflows show the difficulty in attracting the stickier longer-term allocators that President Xi Jinping’s government wants in China’s financial markets. Some of Asia’s other major markets — like India, South Korea and Japan — are emerging as more attractive alternatives for global investors, as my colleague Ishika Mookerjee wrote here." 
      },
      {
      "source": {
      "id": 7,
      "categoryId":3,
      "name": "Biztoc.com"
      },
      "author": "cointelegraph.com",
      "title": "AI trends at all-time high on Google but Bitcoin still did it better",
      "description": "Global search interest for the term “AI” has reached a new all-time high on Google, though it’s yet to hold a candle to Bitcoin (BTC) peak mania in 2017, data has revealed. Artificial intelligence has dominated headlines over the past few months, with some su…",
      "image": "/images/image7.jpeg",
      "publishedAt": "2023-06-02T04:22:06Z",
      "content": "Global search interest for the term “AI” has reached a new all-time high on Google, though it’s yet to hold a candle to peak Bitcoin BTC tickers down $27,108 mania in 2017, data has revealed. Artificial intelligence has dominated headlines over the past few months, with some suggesting that it’s the latest “tech fad” after crypto and the metaverse. Most recently, OpenAI executives warned in a May 23 blog post that within the next 10 years, AI will exceed expert skill level in “most domains” and be as productive as “one of today’s largest corporations.”However, while global and United States search interest for AI has reached a fever pitch, clocking in at 89 on Google Trends, it is still shy of Bitcoin’s peak search interest of 100 in December 2017, when Bitcoin was nearing its then-high of $20,000. Mark Schilsky, an Alliance Bernstein technology specialist, noted on May 31 that AI was “still far below the absolute hype of Bitcoin,” according to a report from Business Insider. His analysis was specifically focused on United States search trends. Schilisky compared the three “buzziest segments of the tech industry” over the past 10 years — “AI,” “metaverse,” and “Bitcoin” — to reveal that the peak search volume for “Bitcoin” is higher than the peak search volume for AI so far."},
      {
      "source": {
      "id": 8,
      "categoryId":3,
      "name": "International Business Times"
      },
      "author": "Marvie Basilan",
      "title": "EU Digital Specialists To Put Twitter Under 'Stress Test' This Month",
      "description": "Twitter will be put to the test this month to give the platform a preview of how the European Union will enforce its rules that it expects digital platforms to follow.",
      "image": "/images/image8.jpeg",
      "publishedAt": "2023-06-02T04:13:43Z",
      "content": "Twitter will be subjected to a 'stress test' by European Union digital specialists this month, Thierry Breton, the European Commissioner for the internal market, said Thursday. Breton, who has repeatedly called on the social media platform to adhere to the bloc's tech regulations, said in an interview that a team of about five to 10 digital specialists from the EU will put Twitter and possibly other tech companies under 'stress tests' late this month, The Wall Street Journal reported. The French business executive clarified that the stress test is voluntary and does not have enforcement or monetary consequences, but it will give Twitter an idea of how the bloc's Digital Services Act (DSA) will be enforced. Breton's comments come days after he revealed that Twitter has left the EU's voluntary Code of Practice against disinformation. The EU's digital chief warned that even if the social media platform pulled out of the disinformation code, 'obligations remain.' 'You can run but you can't hide,' he said."
      },
      
      {
      "source": {
      "id": 9,
      "categoryId":3,
      "name": "CleanTechnica"
      },
      "author": "Paul Fosse",
      "title": "CleanTechnica Tested: TESCAMP Mattress, Y Not Sleep In Your Tesla?",
      "description": "A week ago, I was contacted by a company called TESCAMP. They wondered if I would like to try out their mattress for the Model Y for free. In exchange, I agreed to write an honest review on this site. Since I had slept in my electric cars a bunch of times ove…",
      "image": "/images/image9.jpeg",
      "publishedAt": "2023-06-02T03:51:07Z",
      "content": "A week ago, I was contacted by a company called TESCAMP. They wondered if I would like to try out their mattress for the Model Y for free. In exchange, I agreed to write an honest review on this site. Since I had slept in my electric cars a bunch of times over the last 12 years, I jumped at the chance to review their product. I had looked at the Dreamcase a few years ago, but at over $800 with sheets, shipping, and tax, I didn’t think I would get enough use out of it to justify the purchase. TESCAMP makes a similar quality product available for less than $250, including sheets and shipping (prices subject to change). Note: If you use this link, I get a small commission that I will be donating a portion of to CleanTechnica.com to further its mission. You can also use the discount code “Paul” for 5% off."},
      {
      "source": {
      "id": 10,
      "categoryId":4,
      "name": "CNBC"
      },
      "author": "Evelyn Cheng",
      "title": "Chinese EV startup Li Auto says car deliveries more than doubled in May",
      "description": "Chinese electric car startup Li Auto said it delivered more than twice as many cars in May versus a year ago.",
      "image": "/images/image10.jpeg",
      "publishedAt": "2023-06-02T03:49:26Z",
      "content": "BEIJING — Chinese electric car startup Li Auto said it delivered more than twice as many cars in May versus a year ago. For a third-straight month, Li Auto’s deliveries topped 20,000 with a climb to 28,277 vehicles in May, according to a release Thursday. That’s up by about 146% from a year ago. In contrast, competitors Nio and Xpeng both reported a year-over-year drop in monthly deliveries. Li Auto differs from the two startups in that its electric cars come with a fuel tank for charging the battery and extending driving range. That divergence comes as China’s fast-growing electric car market grows more competitive. Average selling price is down by about 10% to 15% across brands, Bank of America Securities’ head of Asia Pacific basic materials, Matty Zhao said Friday on CNBC’s “Street Signs Asia.” She expects China’s electric car market to grow by 27% this year to 8.7 million units, with penetration of overall auto sales set to grow to 32% this year, versus 26% last year. Some brands, such as Xpeng, are trying to compete by selling advanced assisted driving technology. Xpeng said it delivered 7,506 electric cars in May, up by a few hundred from April. The company said its P7i sedan saw a “substantial increase” in deliveries. Last week, management said wait times for P7i orders was more than six weeks due to production delays, which they expected would improve in June. The company projected a significant increase in overall deliveries to more than 20,000 vehicles a month in the fourth quarter. Nio delivered 6,155 cars in May, down from April and a year ago. The company is set to release quarterly earnings on June 9. Based on Li Auto’s reported and forecast deliveries, the company expects to deliver at least 22,000 vehicles in June. Those monthly deliveries are still only a fraction of the market compared with industry giants Tesla and BYD."
    },
      {
      "source": {
      "id": 11,
      "categoryId":4,
      "name": "Biztoc.com"
      },
      "author": "asia.nikkei.com",
      "title": "Tata's EV dominance in India faces challengers even without Tesla",
      "description": "MUMBAI -- Hyundai Motor and MG are among the electric vehicle makers challenging Tata Motors' dominance in India, a market where Tesla has yet to arrive and Chinese automakers face hurdles to investment. Hyundai Motor India plans to invest 200 billion rupees …",
      "image": "/images/image11.jpeg",
      "publishedAt": "2023-06-02T03:40:07Z",
      "content": "MUMBAI -- Hyundai Motor and MG are among the electric vehicle makers challenging Tata Motors' dominance in India, a market where Tesla has yet to arrive and Chinese automakers face hurdles to investment. Hyundai Motor India plans to invest 200 billion rupees ($2.42 billion) over 10 years to develop an electric vehicle supply chain and charging network in the country, the company said May 11. South Korea-based Hyundai faces an outsize rival in India's Tata Motors, which held an 85% share of EV sales in its domestic market last year, British research firm LMC Automotive reports. Hyundai aims to increase EV production at its plant in India's southern state of Tamil Nadu, and also build a battery factory and charging stations there. A memorandum of understanding with the state government was signed in the presence of Tamil Nadu Chief Minister M.K. Stalin. Hyundai has been touting its EV lineup in India. Bollywood star Shah Rukh Khan, a Hyundai India brand ambassador, appeared at an international auto expo in New Delhi in January to promote the automaker's new global flagship EV, the Ioniq 5. Low-priced gasoline-burning cars still rule India's auto market, the world's third largest. Maruti Suzuki is the overall market leader, with 41% of passenger car sales nationwide in the year ended March 2023, the Society of Indian Automobile Manufacturers reports. Hyundai and Tata followed with 15% and 14%, respectively."
    },
      {
      "source": {
      "id": 12,
      "categoryId":4,
      "name": "CryptoGlobe"
      },
      "author": "Francisco Memoria",
      "title": "Floki Inu Users Can Now Shop on AliExpress with $FLOKI",
      "description": "Popular meme-inspired cryptocurrency Floki Inu ($FLOKI) has recently announced that its users can now purchase products on AliExpress, one of the world’s leading e-commerce platforms, using the cryptocurrency. The integration has been facilitated through Shop…",
      "image": "/images/image12.jpeg",
      "publishedAt": "2023-06-02T03:33:00Z",
      "content": "Popular meme-inspired cryptocurrency Floki Inu ($FLOKI) has recently announced that its users can now purchase products on AliExpress, one of the world’s leading e-commerce platforms, using the cryptocurrency. The integration has been facilitated through Shopping.io, a platform that allows consumers to make purchases with cryptocurrencies. This new feature enables users to browse and buy from a selection of over 100 million items available on AliExpress, a platform that ships to over 200 countries , ensuring that a vast majority of Floki Inu’s user base can leverage this feature, thereby enhancing the practical utility of the FLOKI token​​.Shopping.io, a platform dedicated to bridging the gap between cryptocurrencies and e-commerce, is instrumental in this integration. The platform facilitates transactions using various cryptocurrencies, now including Floki Inu, allowing users to enjoy a seamless shopping experience on platforms like AliExpress. The introduction of Floki Inu on AliExpress marks a significant expansion of the FLOKI ecosystem, reflecting the growing acceptance and utility of cryptocurrencies in the world of e-commerce. For Floki Inu, a cryptocurrency inspired by the pet dog of Elon Musk, the Tesla and SpaceX CEO, this represents a critical milestone."
    }
  ],
  "categories": [
    {
      "id": 1,
      "categoryName": "Hot News!"
     
    },
    {
      "id": 2,
      "categoryName": "Economy"
     
    },
    {
      "id": 3,
      "categoryName": "Technology"
     
    },
    {
      "id": 4,
      "categoryName": "Politics"
    
    }
  ]
}